In [1]:
import pandas as pd
import numpy as np

In [2]:
d1={
    'City':['Hyderabad','Delhi','Mumbai','Chennai','Lucknow'],
    'Population':[1.5,2,2.5,1.75,1.5]
}

In [3]:
dfind=pd.DataFrame(d1)

In [4]:
dfind

        City  Population
0  Hyderabad        1.50
1      Delhi        2.00
2     Mumbai        2.50
3    Chennai        1.75
4    Lucknow        1.50

In [5]:
from sklearn.preprocessing import OneHotEncoder # imported OneHotEncoder

In [6]:
ohe=OneHotEncoder() # Created object

In [8]:
ohe.fit(dfind[['City']]) # Trained the object
# It takes two dimension data(DataFrame) only,hence double brackets given.

OneHotEncoder()

In [9]:
ohe.transform(dfind[['City']]) # Transformed the data

<5x5 sparse matrix of type '<class 'numpy.float64'>'
	with 5 stored elements in Compressed Sparse Row format>

In [10]:
cityary1=ohe.transform(dfind[['City']]).toarray()

In [11]:
cityary1

array([[0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.]])

In [12]:
pd.DataFrame(cityary1)

     0    1    2    3    4
0  0.0  0.0  1.0  0.0  0.0
1  0.0  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  1.0
3  1.0  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  1.0  0.0

In [13]:
ohe.categories_ # just to get the sequence of cities

[array(['Chennai', 'Delhi', 'Hyderabad', 'Lucknow', 'Mumbai'], dtype=object)]

In [14]:
dfencode=pd.DataFrame(cityary1,columns=['Chennai', 'Delhi', 'Hyderabad', 'Lucknow', 'Mumbai'],dtype='int')

In [15]:
dfencode

   Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0        0      0          1        0       0
1        0      1          0        0       0
2        0      0          0        0       1
3        1      0          0        0       0
4        0      0          0        1       0

In [16]:
dfind

        City  Population
0  Hyderabad        1.50
1      Delhi        2.00
2     Mumbai        2.50
3    Chennai        1.75
4    Lucknow        1.50

In [17]:
dfind=pd.concat([dfind,dfencode],axis=1)

In [18]:
dfind

        City  Population  Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0  Hyderabad        1.50        0      0          1        0       0
1      Delhi        2.00        0      1          0        0       0
2     Mumbai        2.50        0      0          0        0       1
3    Chennai        1.75        1      0          0        0       0
4    Lucknow        1.50        0      0          0        1       0

In [19]:
dfind=dfind.drop('City',axis=1) # u can also write 'inplace=True' here for permanent change
# OR# dfind.drop('City',axis=1,inplace=True)

In [21]:
dfind

   Population  Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0        1.50        0      0          1        0       0
1        2.00        0      1          0        0       0
2        2.50        0      0          0        0       1
3        1.75        1      0          0        0       0
4        1.50        0      0          0        1       0

In [22]:
dfind=dfind[['Chennai', 'Delhi', 'Hyderabad', 'Lucknow', 'Mumbai','Population']]

In [23]:
dfind

   Chennai  Delhi  Hyderabad  Lucknow  Mumbai  Population
0        0      0          1        0       0        1.50
1        0      1          0        0       0        2.00
2        0      0          0        0       1        2.50
3        1      0          0        0       0        1.75
4        0      0          0        1       0        1.50